p3p/pio-framework-arduino-lpc176x/system/CMSIS/lib/usb/mscuser.cpp
/*
 *  MSC Mass Storage Reset Request Callback
 *   Called automatically on Mass Storage Reset Request
 *    Parameters:      None (global SetupPacket and EP0Buf)
 *    Return Value:    TRUE - Success, FALSE - Error
 */

uint32_t MSC_Reset (void) {
  //USB_DMA_Disable(MSC_EP_IN);
  _DBG("MSC_Reset state "); _DBD32(BulkStage); _DBG("\n");
  BulkStage = MSC_BS_CBW;
  ep_in_stalled = false;
  USB_DMA_Trigger(MSC_EP_OUT);
  return (TRUE);
}

/*
 *  MSC Mass Storage Unstall request callback
 *   Called when one of the msc bulk endpoints is unstalled
 *    Parameters:      EPNum the endpoint that is being unstalled
 *    Return Value:    None
 */

void MSC_UnstallEP(uint32_t EPNum) {
  if ((EPNum == MSC_EP_IN) && ep_in_stalled) {
    /* Compliance Test: rewrite CSW after unstall */
    if (CSW.dSignature == MSC_CSW_Signature) {
      //USB_WriteEP(MSC_EP_IN, (uint8_t *) &CSW, sizeof(CSW));
      //for(int i = 0; i < sizeof(CSW); i++)
        //BulkBuf[i] = ((uint8_t *)&CSW)[i];
      MSC_QueueDMAIO(MSC_EP_IN, (uint8_t *)&CSW, sizeof(CSW));
        //MSC_QueueDMAIO(MSC_EP_IN, BulkBuf, sizeof(CSW));
    }
    ep_in_stalled = false;
  }
}

void MSC_StallEP(uint32_t EPNum) {
  _DBG("Stall EP\n");
  USB_SetStallEP(EPNum);
  //USB_DMA_Setup(MSC_EP_IN, nullptr);
  // keep track of the stall state of the IN EP.
  if (EPNum == MSC_EP_IN)
    ep_in_stalled = true;
}

/*
 *  MSC Get Max LUN Request Callback
 *   Called automatically on Get Max LUN Request
 *    Parameters:      None (global SetupPacket and EP0Buf)
 *    Return Value:    TRUE - Success, FALSE - Error
 */

uint32_t MSC_GetMaxLUN (void) {

  EP0Buf[0] = 0;               /* No LUN associated with this device */
  return (TRUE);
}

bool MSC_CheckAvailable(void) {
  if (MSC_BlockCount == 0)
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::MEDIUM_NOT_PRESENT, Sense_ASCQ::LOADABLE);
  else if (media_lock == DEVICE_LOCK)
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::MEDIUM_NOT_PRESENT, Sense_ASCQ::REASON_UNKNOWN);
  else if (device_wants_lock) {
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::MEDIUM_NOT_PRESENT, Sense_ASCQ::REASON_UNKNOWN);
    // indicate the device can have the lock
    media_lock = NO_LOCK;
  }
  else
    return true;
    //_DBG("Available fail\n");
  CSW.bStatus = CSW_CMD_FAILED;
  MSC_SetCSW();
  return false;
}

bool host_get_lock(void) {
  if (MSC_CheckAvailable()) {
    media_lock = HOST_LOCK;
    return true;
  }
  return false;
}

/*
 *  MSC Memory Read Callback
 *   Called automatically on Memory Read Event
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */
void MSC_MemoryRead (void) {
  if(!host_get_lock()) {
    _DBG("Lock failed\n");
     return;
  }
  WDT_Feed();
  IOBuffer& buf = Buffers[BufferOut];
  //_DBG("MRead "); _DBD32(BufferOut); _DBG("\n");
  if (buf.contents == BUFFER_EMPTY) {
    rwcnt++;
    return;
  }
  //_DBG("MRead write\n");
  MSC_QueueDMAIO(MSC_EP_IN, buf.buffer, buf.length);
  CSW.dDataResidue -= buf.length;
  length -= buf.length;

  if (length == 0) {
    BulkStage = MSC_BS_DATA_LAST;
  }

  if (BulkStage != MSC_BS_DATA_IN) {
    CSW.bStatus = CSW_CMD_PASSED;
    sense_data.reset();
  }

}

/*
 *  MSC Memory Write Callback
 *   Called automatically on Memory Write Event
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_MemoryWrite (void) {
  if(!host_get_lock()) {
     return;
  }
  WDT_Feed();
  IOBuffer& buf = Buffers[BufferIn];
  buf.contents = lba;
  buf.length = BulkLen;
  lba += (BulkLen/MSC_BLOCK_SIZE);
  BufferIn = (BufferIn + 1) % MSC_IO_BUFFERS;
  length -= BulkLen;
  CSW.dDataResidue -= BulkLen;
  if (length == 0) {
    CSW.bStatus = CSW_CMD_PASSED;
    sense_data.reset();
    BulkStage = MSC_BS_DATA_FLUSH;
  }
}


/*
 *  MSC Memory Verify Callback
 *   Called automatically on Memory Verify Event
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_MemoryVerify (void) {
  if(!host_get_lock()) {
     return;
  }
  WDT_Feed();
  length -= BulkLen;
  CSW.dDataResidue -= BulkLen;

  if (length == 0) {
    if(MemOK) {
      CSW.bStatus = CSW_CMD_PASSED;
      sense_data.reset();
    } else {
      CSW.bStatus = CSW_CMD_FAILED;
      sense_data.set(Sense_KEY::MEDIUM_ERROR);
    }
    MSC_SetCSW();
  }
}

/*
 * MSC_RunDeferredCommands
 * Called to allow comands that access shared hardware to run outside
 * of an interrupt context. Should be called from "main loop" of the
 * user program.
 */
void MSC_RunDeferredCommands() {
  for (int i =0; i < MSC_IO_BUFFERS; i++) {
  switch(BulkStage) {
    case MSC_BS_DATA_IN: {
      IOBuffer& buf = Buffers[BufferIn];
      if (buf.contents == BUFFER_EMPTY && transfer_count > 0) {
        //_DBG("Read "); _DBD32(lba); _DBG(" cnt "); _DBD(transfer_count); _DBG(" in "); _DBD32(BufferIn); _DBG("\n");
        uint32_t bcnt = (transfer_count > MSC_IO_BUFFER_SIZE/MSC_BLOCK_SIZE ? MSC_IO_BUFFER_SIZE/MSC_BLOCK_SIZE : transfer_count);
        disk_read (0, buf.buffer, lba, bcnt);
        buf.length = bcnt*MSC_BLOCK_SIZE;
        buf.contents = lba;
        lba += bcnt;
        transfer_count -= bcnt;
        BufferIn = (BufferIn + 1) % MSC_IO_BUFFERS;
        USB_DMA_Trigger(MSC_EP_IN);
        rcnt++;
      }
      else
        return;
      break;
    }
    case MSC_BS_DATA_FLUSH:
    case MSC_BS_DATA_OUT: {
      IOBuffer& buf = Buffers[BufferOut];
      if (buf.contents != BUFFER_EMPTY && transfer_count > 0) {
        uint32_t bcnt = buf.length/MSC_BLOCK_SIZE;
        disk_write(0, buf.buffer, buf.contents, bcnt);
        buf.contents = BUFFER_EMPTY;
        BufferOut = (BufferOut + 1) % MSC_IO_BUFFERS;
        transfer_count -= bcnt;
        if (transfer_count == 0) {
          BulkStage = MSC_BS_DATA_LAST;
          USB_DMA_Trigger(MSC_EP_IN);
        }
        else
          USB_DMA_Trigger(MSC_EP_OUT);
        wcnt++;
      }
      else
        return;
      break;
    }
    default:
      return;
  }
}
}


/*
 *  MSC SCSI Read/Write Setup Callback
 *    Parameters:      None (global variables)
 *    Return Value:    TRUE - Success, FALSE - Error
 */

uint32_t MSC_RWSetup (void) {

